Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.153/PIC32CM-LS00/svd/PIC32CM5164LS00100.svd
            <register>
               <name>APBCMASK</name>
               <description>APBC Mask</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x001FFFFF</resetValue>
               <fields>
                  <field>
                     <name>EVSYS_</name>
                     <description>EVSYS APB Clock Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM0_</name>
                     <description>SERCOM0 APB Clock Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM1_</name>
                     <description>SERCOM1 APB Clock Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM2_</name>
                     <description>SERCOM2 APB Clock Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM3_</name>
                     <description>SERCOM3 APB Clock Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM4_</name>
                     <description>SERCOM4 APB Clock Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SERCOM5_</name>
                     <description>SERCOM5 APB Clock Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC0_</name>
                     <description>TC0 APB Clock Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC1_</name>
                     <description>TC1 APB Clock Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TC2_</name>
                     <description>TC2 APB Clock Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC0_</name>
                     <description>TCC0 APB Clock Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC1_</name>
                     <description>TCC1 APB Clock Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC2_</name>
                     <description>TCC2 APB Clock Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCC3_</name>
                     <description>TCC3 APB Clock Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ADC_</name>
                     <description>ADC APB Clock Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DAC_</name>
                     <description>DAC APB Clock Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PTC_</name>
                     <description>PTC APB Clock Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRNG_</name>
                     <description>TRNG APB Clock Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CCL_</name>
                     <description>CCL APB Clock Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>I2S_</name>
                     <description>I2S APB Clock Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OPAMP_</name>
                     <description>OPAMP APB Clock Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>MPU</name>
         <description>Memory Protection Unit</description>
         <groupName>MPU</groupName>
         <prependToName>MPU_</prependToName>
         <baseAddress>0xE000ED90</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x38</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>TYPE</name>
               <description>MPU Type Register</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>SEPARATE</name>
                     <description>Separate instructions and data address regions</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DREGION</name>
                     <description>Number of MPU data regions</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL</name>
               <description>MPU Control Register</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>MPU enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HFNMIENA</name>
                     <description>HardFault, NMI enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIVDEFENA</name>
                     <description>Privileged default enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RNR</name>
               <description>MPU Region Number Register</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>REGION</name>
                     <description>Selected region number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RBAR</name>
               <description>MPU Region Base Address Register</description>
               <addressOffset>0xC</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>XN</name>
                     <description>Execute Never</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AP</name>
                     <description>Access permissions</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>APSelect</name>
                        <enumeratedValue>
                           <name>RWPRIV</name>
                           <description>Read/write by privileged code only</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RWANY</name>
                           <description>Read/write by any privilege level</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RPRIV</name>
                           <description>Read-only by privileged code only</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RANY</name>
                           <description>Read-only by any privilege level</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SH</name>
                     <description>Shareability</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>SHSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Non-shareable</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OUTER</name>
                           <description>Outer shareable</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INNER</name>
                           <description>Inner shareable</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BASE</name>
                     <description>Base address</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>27</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RLAR</name>
               <description>MPU Region Limit Address Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>EN</name>
                     <description>Region enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AttrInd</name>
                     <description>Attribute Index</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>LIMIT</name>
                     <description>Limit address</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>27</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAIR0</name>
               <description>MPU Memory Attribute Indirection Register 0</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>Attr0</name>
                     <description>Attribute of MPU region 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Attr1</name>
                     <description>Attribute of MPU region 1</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Attr2</name>
                     <description>Attribute of MPU region 2</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Attr3</name>
                     <description>Attribute of MPU region 3</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MAIR1</name>
               <description>MPU Memory Attribute Indirection Register 1</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>Attr4</name>
                     <description>Attribute of MPU region 4</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Attr5</name>
                     <description>Attribute of MPU region 5</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Attr6</name>
                     <description>Attribute of MPU region 6</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>Attr7</name>
                     <description>Attribute of MPU region 7</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
